mwg.wb.pkg.productold/soapxml/GetPromotionByCode.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GetPromotionByCode xmlns="http://tempuri.org/">
			<strAuthen>{strAuthen}</strAuthen>
			<objResultMessage>
				<IsError>false</IsError>
				<ErrorType>No_Error</ErrorType>
				<Message>string</Message>
				<MessageDetail>string</MessageDetail>
				<ErrorCode>0</ErrorCode>
				<Parram>string</Parram>
			</objResultMessage>
			<objKeywords>
				<anyType xsi:type="xsd:string">@ProductID</anyType>
				<anyType xsi:type="xsd:string">{ProductID}</anyType>
				<anyType xsi:type="xsd:string">@Imei</anyType>
				<anyType xsi:type="xsd:string">{Imei}</anyType>
				<anyType xsi:type="xsd:string">@StoreID</anyType>
				<anyType xsi:type="xsd:string">{StoreID}</anyType>
				<anyType xsi:type="xsd:string">@InventoryStatusID</anyType>
				<anyType xsi:type="xsd:string">{InventoryStatusID}</anyType>
				<anyType xsi:type="xsd:string">@SiteID</anyType>
				<anyType xsi:type="xsd:string">{SiteID}</anyType>
			</objKeywords>
		</GetPromotionByCode>
	</soap:Body>
</soap:Envelope>